{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# https://neo4j.com/developer/guide-import-csv/\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "url = \"bolt://localhost:7687\"\n",
    "\n",
    "# Enter your own password for the second auth argument\n",
    "driver = GraphDatabase.driver(url, auth=(\"neo4j\", ENTER-YOUR-OWN-PASSWORD-HERE))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    " def make_knowledge_graph(tx): ## CREATES THE NODES\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row \n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MERGE (o: OxidativeStress {stress: 'oxidative stress'})\n",
    "    MERGE (e: Event {biological_event: row.Biological_Events_of_Oxidative_Stress})\n",
    "    MERGE (c: Category {category: row.Molecular_and_Functional_Categories})\n",
    "    MERGE (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    RETURN *\n",
    "    \"\"\")\n",
    "    \n",
    "# OS -> Initiation\n",
    "def OS_initiation_ROS(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Reactive Oxygen Species (ROS)'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Superoxides', 'Hydrogen Peroxide', 'Hydroxyl Radical', 'Singlet Oxygen', 'Peroxides', 'Epoxy Compounds']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_initiation_ROS_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Initiation of Oxidative Stress'}), (c:Category {category:'Reactive Oxygen Species (ROS)'})\n",
    "    MERGE (o)<-[:CATEGORY_OF]-(e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_initiation_RON(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Reactive Nitrogen Species (RNS)'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Nitric Oxide', 'Nitrogen Dioxide', 'Peroxynitrous Acid']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_initiation_RON_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Initiation of Oxidative Stress'}), (c:Category {category:'Reactive Nitrogen Species (RNS)'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_initiation_Lipid(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Lipid peroxide radicals'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Lipid Peroxidation', 'Lipid Peroxides', 'Fatty Acids, Unsaturated', 'Superoxides']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "    \n",
    "def OS_initiation_Lipid_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Initiation of Oxidative Stress'}), (c:Category {category:'Lipid peroxide radicals'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_initiation_Aldehydes(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Reactive Aldehydes'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Aldehydes', 'Malondialdehyde', 'Lipid Peroxides']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "def OS_initiation_Aldehydes_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Initiation of Oxidative Stress'}), (c:Category {category:'Reactive Aldehydes'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "# OS -> Regulation\n",
    "def OS_regulation_redox_metabolites(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Redox Metabolites'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Cysteine', 'Homocysteine', 'Glutathione', 'NAD', 'NADP', 'Flavin-Adenine Dinucleotide', 'Cystine', 'Glutathione Disulfide', 'Quinones', 'Disulfides']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_regulation_redox_metabolites_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Regulation of Oxidative Stress'}), (c:Category {category:'Redox Metabolites'})\n",
    "    MERGE (o)<-[:CATEGORY_OF]-(e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_regulation_antioxidant_enzymes(tx): # missing isoenzymes on line 55? Methionine Sulfoxide Reductases repeat. Thioredoxins on tree but not in the spread sheet for this categogy \n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Antioxidant Enzymes'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['NF-E2-Related Factor 2', 'MafK Transcription Factor', 'Glutamate-Cysteine Ligase', 'NAD(P)H Dehydrogenase (Quinone)', 'Glutathione Reductase', 'Catalase', 'Glutathione S-Transferase pi', 'Glutathione Transferase', 'Glutathione Peroxidase', 'Superoxide Dismutase', 'Methionine Sulfoxide Reductases', 'Oxidoreductases']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "    \n",
    "def OS_regulation_antioxidant_enzymes_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Regulation of Oxidative Stress'}), (c:Category {category:'Antioxidant Enzymes'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "    \n",
    "def OS_regulation_redox_reg_proteins(tx): # Thioredoxins repeat line 105, Membrane Proteins repeat line 106, nuclear protein repeat line 146, carrier protein repeat 156\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Redox Regulating Proteins'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Thioredoxins', 'Ribonucleoprotein, U5 Small Nuclear', 'Nuclear Proteins', 'Cell Cycle Proteins', 'Thioredoxin Reductase 1', 'Thioredoxin Reductase 2', 'Thioredoxin-Disulfide Reductase', 'Glutathione Reductase', 'Carrier Proteins', 'Membrane Proteins', 'Seminal Plasma Proteins', 'Protein Disulfide Reductase (Glutathione)', 'Membrane Glycoproteins', 'Antigens, Neoplasm', 'Peroxiredoxins', 'Peroxiredoxin III', 'Peroxiredoxin IV', 'Oxidoreductases', 'Oxidoreductases Acting on Sulfur Group Donors', 'Glutaredoxins', 'Protein Disulfide-Isomerases', 'Procollagen-Proline Dioxygenase', 'Selenoprotein W', 'Selenoproteins', 'Methionine Sulfoxide Reductases', 'DNA-Binding Proteins', 'Oxidoreductases']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_regulation_redox_reg_proteins_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Regulation of Oxidative Stress'}), (c:Category {category:'Redox Regulating Proteins'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_regulation_Antioxidants(tx): # Ascorbic Acid repeat line 202\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Antioxidants'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Vitamin E', 'Tocopherols', 'Tocotrienols', 'Vitamin A', 'Ascorbic Acid', 'Selenium', 'Carotenoids', 'beta Carotene', 'Lutein', 'Manganese', 'Melatonin', 'Zeaxanthins', 'Lycopene']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "def OS_regulation_Antioxidants_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Regulation of Oxidative Stress'}), (c:Category {category:'Antioxidants'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "# OS -> outcomes\n",
    "def OS_outcomes_protein_oxidation(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Protein Oxidation (O-PTMs)'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Protein Carbonylation', 'Hydroxylation']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_outcomes_protein_oxidation_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Outcomes of Oxidative Stress'}), (c:Category {category:'Protein Oxidation (O-PTMs)'})\n",
    "    MERGE (o)<-[:CATEGORY_OF]-(e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_outcomes_Lipid_Peroxidation(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Lipid Peroxidation Products'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Aldehydes', 'Malondialdehyde']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "    \n",
    "def OS_outcomes_Lipid_Peroxidation_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Outcomes of Oxidative Stress'}), (c:Category {category:'Lipid Peroxidation Products'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_outcomes_Oxidative_DNA_Damage(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Oxidative DNA Damage'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Deoxyguanosine']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "    \n",
    "def OS_outcomes_Oxidative_DNA_Damage_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Outcomes of Oxidative Stress'}), (c:Category {category:'Oxidative DNA Damage'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "\n",
    "def OS_outcomes_Nitrative_DNA_Damage(tx):\n",
    "    tx.run(\"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM 'file:///OSTerms1.csv' AS row\n",
    "    WITH row WHERE row.MeSH_Heading IS NOT NULL\n",
    "    MATCH (c:Category {category:'Nitrative DNA Damage'}), (h: MeSH_Heading {mesh_heading: row.MeSH_Heading})\n",
    "    WHERE h.mesh_heading IN ['Guanine']\n",
    "    MERGE (c)<-[:CANDIDATE_OF]-(h)\n",
    "    \"\"\")\n",
    "    \n",
    "def OS_outcomes_Nitrative_DNA_Damage_2(tx):\n",
    "    tx.run(\"\"\"\n",
    "    MATCH (o: OxidativeStress {stress: 'oxidative stress'}), (e: Event {biological_event: 'Outcomes of Oxidative Stress'}), (c:Category {category:'Nitrative DNA Damage'})\n",
    "    MERGE (e)<-[:FUNCTIONAL_CATEGORY]-(c)\n",
    "    \"\"\")\n",
    "    \n",
    "with driver.session() as session: \n",
    "    session.write_transaction(make_knowledge_graph)\n",
    "    session.write_transaction(OS_initiation_ROS)\n",
    "    session.write_transaction(OS_initiation_ROS_2)\n",
    "    session.write_transaction(OS_initiation_RON)\n",
    "    session.write_transaction(OS_initiation_RON_2)\n",
    "    session.write_transaction(OS_initiation_Lipid)\n",
    "    session.write_transaction(OS_initiation_Lipid_2)\n",
    "    session.write_transaction(OS_initiation_Aldehydes)\n",
    "    session.write_transaction(OS_initiation_Aldehydes_2)\n",
    "    session.write_transaction(OS_regulation_redox_metabolites)\n",
    "    session.write_transaction(OS_regulation_redox_metabolites_2)\n",
    "    session.write_transaction(OS_regulation_antioxidant_enzymes)\n",
    "    session.write_transaction(OS_regulation_antioxidant_enzymes_2)\n",
    "    session.write_transaction(OS_regulation_redox_reg_proteins)\n",
    "    session.write_transaction(OS_regulation_redox_reg_proteins_2)\n",
    "    session.write_transaction(OS_regulation_Antioxidants)\n",
    "    session.write_transaction(OS_regulation_Antioxidants_2)\n",
    "    session.write_transaction(OS_outcomes_protein_oxidation)\n",
    "    session.write_transaction(OS_outcomes_protein_oxidation_2)\n",
    "    session.write_transaction(OS_outcomes_Lipid_Peroxidation)\n",
    "    session.write_transaction(OS_outcomes_Lipid_Peroxidation_2)\n",
    "    session.write_transaction(OS_outcomes_Oxidative_DNA_Damage)\n",
    "    session.write_transaction(OS_outcomes_Oxidative_DNA_Damage_2)\n",
    "    session.write_transaction(OS_outcomes_Nitrative_DNA_Damage)\n",
    "    session.write_transaction(OS_outcomes_Nitrative_DNA_Damage_2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def make_all_PMID_nodes(tx):\n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    RETURN *\n",
    "    \"\"\")\n",
    "def make_constraint(tx):\n",
    "    tx.run(\"\"\"\n",
    "    CREATE CONSTRAINT unique_pmid ON (p:PMID) ASSERT p.pmid IS UNIQUE\n",
    "    \"\"\")\n",
    "def transcription_factors_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.transcription_factors AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Transcription Factors'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def nuclear_proteins_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.nuclear_proteins AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Nuclear Proteins'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def ascorbic_acid_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.ascorbic_acid AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Ascorbic Acid'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def cell_cycle_proteins_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.cell_cycle_proteins AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Cell Cycle Proteins'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def catalase_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.catalase AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Catalase'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def glutathione_peroxidase_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.glutathione_peroxidase AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Glutathione Peroxidase'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def superoxide_dismutase_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.superoxide_dismutase AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Superoxide Dismutase'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def oxidoreductases_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.oxidoreductases AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Oxidoreductases'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def hydrogen_peroxide_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.hydrogen_peroxide AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Hydrogen Peroxide'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def cysteine_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.cysteine AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Cysteine'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def carrier_proteins_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.carrier_proteins AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Carrier Proteins'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def aldehydes_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.aldehydes AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Aldehydes'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def manganese_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.manganese AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Manganese'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def protein_carbonylation_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.protein_carbonylation AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Protein Carbonylation'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def fatty_acids_unsaturated_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"fatty_acids,_unsaturated\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Fatty Acids, Unsaturated'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def nadp_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.nadp AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'NADP'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def hydroxyl_radical_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.hydroxyl_radical AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Hydroxyl Radical'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def membrane_proteins_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.membrane_proteins AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Membrane Proteins'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def lipid_peroxidation_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.lipid_peroxidation AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Lipid Peroxidation'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def malondialdehyde_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.malondialdehyde AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Malondialdehyde'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def nitric_oxide_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.nitric_oxide AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Nitric Oxide'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def nad_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.nad AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'NAD'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def carotenoids_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.carotenoids AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Carotenoids'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def lycopene_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.lycopene AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Lycopene'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def isoenzymes_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.isoenzymes AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Isoenzymes'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def selenium_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.selenium AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Selenium'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def deoxyguanosine_PMID(tx):\n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.deoxyguanosine AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Deoxyguanosine'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def disulfides_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.disulfides AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Disulfides'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def melatonin_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.melatonin AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Melatonin'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def glutathione_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.glutathione AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Glutathione'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def homocysteine_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.homocysteine AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Homocysteine'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def peroxides_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.peroxides AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Peroxides'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def glutathione_reductase_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.glutathione_reductase AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Glutathione Reductase'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def quinones_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.quinones AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Quinones'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def hydroxylation_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.hydroxylation AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Hydroxylation'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def vitamin_a_PMID(tx):\n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.vitamin_a AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Vitamin A'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def glutamatecysteine_ligase_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"glutamate-cysteine_ligase\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Glutamate-Cysteine Ligase'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def thioredoxindisulfide_reductase_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"thioredoxin-disulfide_reductase\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Thioredoxin-Disulfide Reductase'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def superoxides_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.superoxides AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Superoxides'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def glutathione_transferase_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.glutathione_transferase AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Glutathione Transferase'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def thioredoxin_reductase_1_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.thioredoxin_reductase_1 AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Thioredoxin Reductase 1'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def vitamin_e_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.vitamin_e AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Vitamin E'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def tocopherols_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.tocopherols AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Tocopherols'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def guanine_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.guanine AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Guanine'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def beta_carotene_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.beta_carotene AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'beta Carotene'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def singlet_oxygen_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.singlet_oxygen AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Singlet Oxygen'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def peroxynitrous_acid_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.peroxynitrous_acid AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Peroxynitrous Acid'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def cystine_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.cystine AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Cystine'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def thioredoxins_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.thioredoxins AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Thioredoxins'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def flavinadenine_dinucleotide_PMID(tx):  \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"flavin-adenine_dinucleotide\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Flavin-Adenine Dinucleotide'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def lutein_PMID(tx):\n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.lutein AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Lutein'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def nitrogen_dioxide_PMID(tx):\n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.nitrogen_dioxide AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Nitrogen Dioxide'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def glutathione_stransferase_pi_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"glutathione_s-transferase_pi\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Glutathione S-Transferase pi'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def nadph_dehydrogenase_quinone_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"nad(p)h_dehydrogenase_(quinone)\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'NAD(P)H Dehydrogenase (Quinone)'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def lipid_peroxides_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.lipid_peroxides AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Lipid Peroxides'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def glutathione_disulfide_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.glutathione_disulfide AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Glutathione Disulfide'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def tocotrienols_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.tocotrienols AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Tocotrienols'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def epoxy_compounds_PMID(tx):\n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.epoxy_compounds AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Epoxy Compounds'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def methylenetetrahydrofolate_reductase_fadh2_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"5,10-methylenetetrahydrofolate_reductase_(fadh2)\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: '5,10-Methylenetetrahydrofolate Reductase (FADH2)'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def zeaxanthins_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.zeaxanthins AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Zeaxanthins'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\") \n",
    "def ribonucleoprotein_u5_small_nuclear_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"ribonucleoprotein,_u5_small_nuclear\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Ribonucleoprotein, U5 Small Nuclear'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def methionine_sulfoxide_reductases_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value.methionine_sulfoxide_reductases AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Methionine Sulfoxide Reductases'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "def thioredoxin_reductase_two_PMID(tx): \n",
    "    tx.run(\"\"\"\n",
    "    CALL apoc.load.json(\"file:///selected_mesh2pmid.json\")\n",
    "    YIELD value\n",
    "    UNWIND value[\"thioredoxin_reductase_2\"] AS id\n",
    "    MERGE (p: PMID {pmid: id})\n",
    "    ON CREATE\n",
    "        SET p.pmid = id\n",
    "    WITH p\n",
    "    MATCH (h:MeSH_Heading {mesh_heading: 'Thioredoxin Reductase 2'})\n",
    "    MERGE (h)<-[:MENTIONS]-(p)\n",
    "    \"\"\")\n",
    "\n",
    "with driver.session() as session: \n",
    "    session.write_transaction(make_all_PMID_nodes) \n",
    "    session.write_transaction(make_constraint) \n",
    "    session.write_transaction(transcription_factors_PMID) \n",
    "    session.write_transaction(nuclear_proteins_PMID) \n",
    "    session.write_transaction(ascorbic_acid_PMID) \n",
    "    session.write_transaction(cell_cycle_proteins_PMID) \n",
    "    session.write_transaction(catalase_PMID) \n",
    "    session.write_transaction(glutathione_peroxidase_PMID) \n",
    "    session.write_transaction(superoxide_dismutase_PMID) \n",
    "    session.write_transaction(oxidoreductases_PMID) \n",
    "    session.write_transaction(hydrogen_peroxide_PMID) \n",
    "    session.write_transaction(cysteine_PMID) \n",
    "    session.write_transaction(carrier_proteins_PMID) \n",
    "    session.write_transaction(aldehydes_PMID) \n",
    "    session.write_transaction(manganese_PMID) \n",
    "    session.write_transaction(protein_carbonylation_PMID) \n",
    "    session.write_transaction(fatty_acids_unsaturated_PMID) \n",
    "    session.write_transaction(nadp_PMID) \n",
    "    session.write_transaction(hydroxyl_radical_PMID) \n",
    "    session.write_transaction(membrane_proteins_PMID) \n",
    "    session.write_transaction(lipid_peroxidation_PMID) \n",
    "    session.write_transaction(malondialdehyde_PMID) \n",
    "    session.write_transaction(nitric_oxide_PMID) \n",
    "    session.write_transaction(nad_PMID) \n",
    "    session.write_transaction(carotenoids_PMID) \n",
    "    session.write_transaction(lycopene_PMID) \n",
    "    session.write_transaction(isoenzymes_PMID)\n",
    "    session.write_transaction(selenium_PMID) \n",
    "    session.write_transaction(deoxyguanosine_PMID)\n",
    "    session.write_transaction(disulfides_PMID) \n",
    "    session.write_transaction(melatonin_PMID) \n",
    "    session.write_transaction(glutathione_PMID)\n",
    "    session.write_transaction(homocysteine_PMID)\n",
    "    session.write_transaction(peroxides_PMID)\n",
    "    session.write_transaction(glutathione_reductase_PMID)\n",
    "    session.write_transaction(quinones_PMID) \n",
    "    session.write_transaction(hydroxylation_PMID)\n",
    "    session.write_transaction(vitamin_a_PMID) \n",
    "    session.write_transaction(glutamatecysteine_ligase_PMID)\n",
    "    session.write_transaction(thioredoxindisulfide_reductase_PMID) \n",
    "    session.write_transaction(superoxides_PMID) \n",
    "    session.write_transaction(glutathione_transferase_PMID) \n",
    "    session.write_transaction(thioredoxin_reductase_1_PMID)\n",
    "    session.write_transaction(vitamin_e_PMID) \n",
    "    session.write_transaction(tocopherols_PMID)\n",
    "    session.write_transaction(guanine_PMID)\n",
    "    session.write_transaction(beta_carotene_PMID)\n",
    "    session.write_transaction(singlet_oxygen_PMID)\n",
    "    session.write_transaction(peroxynitrous_acid_PMID)\n",
    "    session.write_transaction(cystine_PMID)\n",
    "    session.write_transaction(thioredoxins_PMID)\n",
    "    session.write_transaction(flavinadenine_dinucleotide_PMID)\n",
    "    session.write_transaction(lutein_PMID) \n",
    "    session.write_transaction(nitrogen_dioxide_PMID) \n",
    "    session.write_transaction(glutathione_stransferase_pi_PMID) \n",
    "    session.write_transaction(nadph_dehydrogenase_quinone_PMID)\n",
    "    session.write_transaction(lipid_peroxides_PMID) \n",
    "    session.write_transaction(glutathione_disulfide_PMID)\n",
    "    session.write_transaction(tocotrienols_PMID) \n",
    "    session.write_transaction(epoxy_compounds_PMID)\n",
    "    session.write_transaction(methylenetetrahydrofolate_reductase_fadh2_PMID)\n",
    "    session.write_transaction(zeaxanthins_PMID) \n",
    "    session.write_transaction(ribonucleoprotein_u5_small_nuclear_PMID)\n",
    "    session.write_transaction(methionine_sulfoxide_reductases_PMID)\n",
    "    session.write_transaction(thioredoxin_reductase_two_PMID)\n",
    "    \n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "@ CYPHER\n",
    "CALL gds.graph.create(\n",
    "'graph_for_algo',\n",
    "['Event', 'Category', 'MeSH_Heading'], \n",
    "['FUNCTIONAL_CATEGORY', 'CANDIDATE_OF']\n",
    ")\n",
    "\n",
    "CALL gds.graph.create(\n",
    "'similarity_graph',\n",
    "['Category', 'MeSH_Heading'], \n",
    "{\n",
    "  CANDIDATE_OF: {\n",
    "    orientation: 'UNDIRECTED'\n",
    "  }\n",
    "}\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# run pagerank on a given projected graph\n",
    "class pagerank():\n",
    "    def __init__(self):\n",
    "        self.driver = GraphDatabase.driver(\"neo4j://localhost:7687\", auth=(\"neo4j\", ENTER-YOUR-OWN-PASSWORD-HERE))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "        \n",
    "    @classmethod\n",
    "    def memory_estimation(cls, tx):\n",
    "        query = (\"Call gds.pageRank.write.estimate('graph_for_algo', {writeProperty: 'pageRank', maxIterations: 30, dampingFactor: 0.85}) YIELD nodeCount, relationshipCount, bytesMin, bytesMax, requiredMemory\")\n",
    "        result = tx.run(query)\n",
    "        return result.single()\n",
    "\n",
    "    @classmethod\n",
    "    def pagerank(cls, tx):\n",
    "        query = (\"Call gds.pageRank.stream('graph_for_algo') YIELD nodeId, score RETURN gds.util.asNode(nodeId) AS Event, score ORDER BY score DESC\")\n",
    "        result = tx.run(query)\n",
    "        return result.data()\n",
    "\n",
    "\n",
    "    def estimate_pagerank(self):\n",
    "        result = self.driver.session().write_transaction(self.memory_estimation)\n",
    "        return result\n",
    "\n",
    "\n",
    "    def run_pagerank(self):\n",
    "        result = self.driver.session().write_transaction(self.pagerank)\n",
    "        result = pd.DataFrame(result) \n",
    "        return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Event</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'biological_event': 'Regulation of Oxidative Stress'}</td>\n",
       "      <td>6.837375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'category': 'Redox Regulating Proteins'}</td>\n",
       "      <td>3.146251</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'biological_event': 'Initiation of Oxidative Stress'}</td>\n",
       "      <td>2.068875</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'category': 'Antioxidants'}</td>\n",
       "      <td>1.807500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'category': 'Antioxidant Enzymes'}</td>\n",
       "      <td>1.488750</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>{'category': 'Redox Metabolites'}</td>\n",
       "      <td>1.425000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>{'biological_event': 'Outcomes of Oxidative Stress'}</td>\n",
       "      <td>1.201875</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>{'category': 'Reactive Oxygen Species (ROS)'}</td>\n",
       "      <td>0.851250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>{'category': 'Reactive Nitrogen Species (RNS)'}</td>\n",
       "      <td>0.532500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>{'category': 'Lipid peroxide radicals'}</td>\n",
       "      <td>0.532500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>{'category': 'Protein Oxidation (O-PTMs)'}</td>\n",
       "      <td>0.405000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>{'category': 'Reactive Aldehydes'}</td>\n",
       "      <td>0.341250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>{'category': 'Lipid Peroxidation Products'}</td>\n",
       "      <td>0.277500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>{'category': 'Oxidative DNA Damage'}</td>\n",
       "      <td>0.277500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>{'category': 'Nitrative DNA Damage'}</td>\n",
       "      <td>0.277500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>{'mesh_heading': 'Superoxides'}</td>\n",
       "      <td>0.150000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>{'mesh_heading': 'Hydrogen Peroxide'}</td>\n",
       "      <td>0.150000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>{'mesh_heading': 'Hydroxyl Radical'}</td>\n",
       "      <td>0.150000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>{'mesh_heading': 'None listed'}</td>\n",
       "      <td>0.150000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>{'mesh_heading': 'Singlet Oxygen'}</td>\n",
       "      <td>0.150000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                     Event     score\n",
       "0   {'biological_event': 'Regulation of Oxidative Stress'}  6.837375\n",
       "1                {'category': 'Redox Regulating Proteins'}  3.146251\n",
       "2   {'biological_event': 'Initiation of Oxidative Stress'}  2.068875\n",
       "3                             {'category': 'Antioxidants'}  1.807500\n",
       "4                      {'category': 'Antioxidant Enzymes'}  1.488750\n",
       "5                        {'category': 'Redox Metabolites'}  1.425000\n",
       "6     {'biological_event': 'Outcomes of Oxidative Stress'}  1.201875\n",
       "7            {'category': 'Reactive Oxygen Species (ROS)'}  0.851250\n",
       "8          {'category': 'Reactive Nitrogen Species (RNS)'}  0.532500\n",
       "9                  {'category': 'Lipid peroxide radicals'}  0.532500\n",
       "10              {'category': 'Protein Oxidation (O-PTMs)'}  0.405000\n",
       "11                      {'category': 'Reactive Aldehydes'}  0.341250\n",
       "12             {'category': 'Lipid Peroxidation Products'}  0.277500\n",
       "13                    {'category': 'Oxidative DNA Damage'}  0.277500\n",
       "14                    {'category': 'Nitrative DNA Damage'}  0.277500\n",
       "15                         {'mesh_heading': 'Superoxides'}  0.150000\n",
       "16                   {'mesh_heading': 'Hydrogen Peroxide'}  0.150000\n",
       "17                    {'mesh_heading': 'Hydroxyl Radical'}  0.150000\n",
       "18                         {'mesh_heading': 'None listed'}  0.150000\n",
       "19                      {'mesh_heading': 'Singlet Oxygen'}  0.150000"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pr_algo = pagerank()\n",
    "result = pr_algo.run_pagerank()\n",
    "pd.set_option('display.max_colwidth', None)\n",
    "result.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'result' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-5-3e1cdf8f549d>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mresult\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtail\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m20\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name 'result' is not defined"
     ]
    }
   ],
   "source": [
    "result.tail(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Enter a MeSH Term: NADP\n",
      "Enter number of desired PMIDs: 10\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>PMID</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4385409</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>6789018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>17027490</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4154398</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>28786954</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>4149971</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>4391279</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>4386480</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>7501259</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>29503433</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       PMID\n",
       "0   4385409\n",
       "1   6789018\n",
       "2  17027490\n",
       "3   4154398\n",
       "4  28786954\n",
       "5   4149971\n",
       "6   4391279\n",
       "7   4386480\n",
       "8   7501259\n",
       "9  29503433"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Suppose you want to find a number of PMIDs for a given MeSH term in this oxidative stress graph\n",
    "mesh_term=input(\"Enter a MeSH Term: \")\n",
    "number_of_terms=int(input(\"Enter number of desired PMIDs: \"))\n",
    "\n",
    "query = \"MATCH (m:MeSH_Heading{mesh_heading:'\" + mesh_term + \"'})-[:MENTIONS]-(p:PMID) RETURN p.pmid\"\n",
    "\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({\"PMID\":item.values()[0]})\n",
    "df = pd.DataFrame(Result)\n",
    "pd.set_option('display.max_colwidth', None)\n",
    "df.head(number_of_terms)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Enter a category Term: Antioxidant Enzymes\n",
      "Enter a category Term: Redox Regulating Proteins\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>MeSH Terms</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Methionine Sulfoxide Reductases</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Oxidoreductases</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Glutathione Reductase</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        MeSH Terms\n",
       "0  Methionine Sulfoxide Reductases\n",
       "1                  Oxidoreductases\n",
       "2            Glutathione Reductase"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Suppose you want to find the shared MeSH terms between two given molecules, enzymes, or proteins\n",
    "mesh_term_1=input(\"Enter a category Term: \")\n",
    "mesh_term_2=input(\"Enter a category Term: \")\n",
    "\n",
    "query = \"MATCH (:Category{category:'\" + mesh_term_1 + \"'})-[:CANDIDATE_OF]-(e:MeSH_Heading)-[:CANDIDATE_OF]-(:Category{category:'\" + mesh_term_2 + \"'}) RETURN e.mesh_heading\"\n",
    "\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({\"MeSH Terms\":item.values()[0]})\n",
    "df = pd.DataFrame(Result)\n",
    "pd.set_option('display.max_colwidth', None)\n",
    "df.head(number_of_terms)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Enter an event related to oxidative stress: Outcomes of Oxidative Stress\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Molecule, Enzyme, or Protein</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nitrative DNA Damage</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Oxidative DNA Damage</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Lipid Peroxidation Products</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Protein Oxidation (O-PTMs)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Molecule, Enzyme, or Protein\n",
       "0         Nitrative DNA Damage\n",
       "1         Oxidative DNA Damage\n",
       "2  Lipid Peroxidation Products\n",
       "3   Protein Oxidation (O-PTMs)"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Suppose you want to find all molecules, enzymes, or proteins that are associated with a given functional category\n",
    "event=input(\"Enter an event related to oxidative stress: \")\n",
    "\n",
    "\n",
    "query = \"MATCH (e:Event{biological_event:'\" + event + \"'})-[:FUNCTIONAL_CATEGORY]-(c:Category) Return c.category\"\n",
    "\n",
    "Result = []\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    for item in info:\n",
    "        Result.append({\"Molecule, Enzyme, or Protein\":item.values()[0]})\n",
    "df = pd.DataFrame(Result)\n",
    "pd.set_option('display.max_colwidth', None)\n",
    "df.head(number_of_terms)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Compound_1</th>\n",
       "      <th>Compound_2</th>\n",
       "      <th>similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Aldehydes</td>\n",
       "      <td>Malondialdehyde</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Carrier Proteins</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Cell Cycle Proteins</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Membrane Proteins</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Nuclear Proteins</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Ribonucleoprotein, U5 Small Nuclear</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Seminal Plasma Proteins</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Thioredoxin Reductase 1</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Thioredoxin Reductase 2</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Antigens, Neoplasm</td>\n",
       "      <td>Thioredoxin-Disulfide Reductase</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           Compound_1                           Compound_2  similarity\n",
       "0           Aldehydes                      Malondialdehyde         1.0\n",
       "1  Antigens, Neoplasm                     Carrier Proteins         1.0\n",
       "2  Antigens, Neoplasm                  Cell Cycle Proteins         1.0\n",
       "3  Antigens, Neoplasm                    Membrane Proteins         1.0\n",
       "4  Antigens, Neoplasm                     Nuclear Proteins         1.0\n",
       "5  Antigens, Neoplasm  Ribonucleoprotein, U5 Small Nuclear         1.0\n",
       "6  Antigens, Neoplasm              Seminal Plasma Proteins         1.0\n",
       "7  Antigens, Neoplasm              Thioredoxin Reductase 1         1.0\n",
       "8  Antigens, Neoplasm              Thioredoxin Reductase 2         1.0\n",
       "9  Antigens, Neoplasm      Thioredoxin-Disulfide Reductase         1.0"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Algo to run similairty algorithm\n",
    "class similarity():\n",
    "    def __init__(self) -> None:\n",
    "        self.driver = GraphDatabase.driver(\"neo4j://localhost:7687\", auth=(\"neo4j\", ENTER-YOUR-OWN-PASSWORD-HERE))\n",
    "\n",
    "    def close(self) -> None:\n",
    "        self.driver.close()\n",
    "\n",
    "    @classmethod\n",
    "    def algo(cls, tx) -> any:\n",
    "        \"\"\"\n",
    "        @param cls is the class\n",
    "        @param tx is the transaction\n",
    "        @return result.data() is the data of the cluster\n",
    "        \"\"\"\n",
    "        query = (\"\"\"\n",
    "        CALL gds.nodeSimilarity.stream('similarity_graph')\n",
    "        YIELD node1, node2, similarity\n",
    "        RETURN gds.util.asNode(node1).mesh_heading AS Compound_1, gds.util.asNode(node2).mesh_heading AS Compound_2, similarity\n",
    "        ORDER BY similarity DESCENDING, Compound_1, Compound_2\n",
    "        \"\"\")\n",
    "        result = tx.run(query)\n",
    "        return result.data()\n",
    "\n",
    "\n",
    "    def run_algo(self) -> any:\n",
    "        \"\"\"\n",
    "        @param self\n",
    "        @return result is the dataframe from the pagerank\n",
    "        \"\"\"\n",
    "        result = self.driver.session().write_transaction(self.algo)\n",
    "        result = pd.DataFrame(result)\n",
    "        return result\n",
    "\n",
    "pd.set_option('display.max_rows', 30)\n",
    "hello = similarity()\n",
    "result = hello.run_algo()\n",
    "result.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
